{
  "header": {
    "nav": {
      "home": "Home",
      "calendar": "Calendar",
      "standings": "Standings",
      "admin": "Admin",
      "schedule": "Schedule Match",
      "playoffs": "Playoffs",
      "ranking": "Summer League 2026 & Annual Ranking"
    },
    "logout": "Logout",
    "login": "Login"
  },
  "playoffs": {
    "title": "Playoffs",
    "roundOf16": "Round of 16",
    "toBeDetermined": "To be determined"
  },
  "qualification": {
    "noRemainingMatches": "No matches left to play. Classification depends on other results.",
    "winAllAndDepend": "Needs to win all remaining matches and hope for favorable results from others.",
    "winAtLeast": "Needs to win at least {{winsNeeded}} of the {{remainingMatches}} remaining matches.",
    "complexScenario": "Classification is complex and depends on multiple result combinations."
  },
  "loading": "Loading...",
  "home": {
    "title": "8 Ball League La Catrina 2025"
  },
  "calendar": {
    "title": "Match Schedule",
    "description": "Check the matchups scheduled for each week",
    "status": {
      "finished": "Finished",
      "scheduled": "Scheduled"
    },
    "noDate": "Date to be determined",
    "location": "Billiard Table",
    "winner": "Winner:",
    "week": "Week {{week}}",
    "scheduledMatches": "{{count}} scheduled matches",
    "group": "Group {{group}}",
    "matches": "{{count}} matches",
    "noMatches": "No matches scheduled",
    "noMatchesForWeek": "No matches found for week {{week}}"
  },
  "standings": {
    "title": "Standings",
    "description": "Check the positions and statistics for each group",
    "stats": {
      "matches": "Matches",
      "won": "Won",
      "lost": "Lost",
      "gamesWon": "Games Won",
      "gamesLost": "Games Lost",
      "winPercentage": "Win %"
    },
    "legend": {
      "title": "Legend",
      "scoring": "Scoring System:",
      "victory": "Win: 3 points",
      "defeat": "Loss: 0 points",
      "tieBreak": "Tie-break Criteria:",
      "criterion1": "1. Highest points",
      "criterion2": "2. Most matches won",
      "criterion3": "3. Most games won"
    },
    "group": "Group {{group}}",
    "groupTitle": "Standings - Group {{group}}",
    "noPlayers": "No players in this group",
    "addPlayersHint": "Add players from the admin panel"
  },
  "login": {
    "title": "Administrative Access",
    "subtitle": "Enter the password to manage the league",
    "password": "Password",
    "error": "Incorrect password",
    "submit": "Enter",
    "footer1": "Only authorized administrators may access",
    "footer2": "Problems accessing? Contact the administrator"
  },
  "ranking": {
    "title": "ELO Ranking System and 2026 Summer League",
    "p1": "La Catrina's next Summer League will begin between late March and early April 2026. In the coming weeks, we will finalize and publish the definitive dates, but we can already announce something important: from now on, the league will be part of an annual ranking system.",
    "h2_1": "Before: Autumn League Prize",
    "p2": "Until now, the Autumn League included accommodation and registration for the top 3 players in the National Tournament in Vitoria in November of each year as a prize.",
    "h2_2": "Now: Annual qualification for the Vitoria team",
    "p3": "From 2026, the system changes:",
    "li1": "A team of 4 players will be formed to represent La Catrina in the Vitoria National.",
    "li2": "Those 4 players will come from an annual ranking, calculated with the ELO system (the same one used in chess and other sports).",
    "p4": "The top 4 in the ELO ranking when the 2026 Summer League ends will be the ones who represent La Catrina in the national tournament. In other words: it is no longer enough to have a good single league; all your official results throughout the year count.",
    "h2_3": "What is ELO and what is it for?",
    "p5": "ELO is a number that tries to measure your real level as a player, based on who you play against and what results you get.",
    "p6": "If you beat strong players, your ELO goes up more.",
    "p7": "If you lose against weak players, your ELO goes down more.",
    "p8": "If you beat someone who has a similar level to yours, your ELO goes up a little.",
    "p9": "If you lose against someone clearly stronger, it hardly penalizes you.",
    "p10": "In summary:",
    "li3": "A higher ELO indicates that, on average, you beat good players.",
    "li4": "A lower ELO indicates that, on average, you lose against good players or only win against much lower-ranked opponents.",
    "h2_4": "How ELO is calculated (explained in plain English)",
    "p11": "The basic idea is:",
    "li5": "Each player has a number: their current ELO.",
    "li6": "Before each match, the system 'estimates' who is the favorite according to each one's ELO.",
    "li7": "After the match:",
    "h3_1": "If the favorite wins, they go up a little and the other goes down a little.",
    "p12": "If the non-favorite wins, they go up a lot and the favorite goes down a lot.",
    "li8": "Ana goes up a few points.",
    "li9": "Pablo goes down the same number of points.",
    "p13": "If they played many times and were tied in wins and losses, their ELOs would stay more or less where they were.",
    "li10": "Ana's ELO is 1700.",
    "li11": "Pablo's ELO is 1400.",
    "p14": "Here the system 'believes' that Ana is a strong favorite.",
    "h3_2": "If Ana wins (as expected):",
    "p15": "Ana goes up very little.",
    "li12": "Pablo goes down very little.",
    "li13": "If Pablo wins (surprise):",
    "p16": "Pablo goes up a lot of points.",
    "li14": "Ana goes down a lot of points.",
    "li15": "The bigger the surprise, the bigger the adjustment.",
    "p17": "What matches count more for ELO",
    "li16": "Not all matches have the same weight. At La Catrina, we have decided that, for the calculation of the ELO and the annual ranking, the matches have different importance depending on the context.",
    "li17": "From highest to lowest weight:",
    "p18": "Semifinals and Final of the leagues",
    "h2_5": "Quarterfinals and round of 16",
    "p19": "League group stage matches",
    "p20": "Monday tournament matches",
    "ol1_li1": "Winning a semifinal or a final against a good player can raise your ELO a lot.",
    "ol1_li2": "Winning a group stage match or a Monday tournament also adds up, but a little less.",
    "ol1_li3": "A defeat in a key playoff match against someone with less ELO can make you go down more than a defeat on any given Monday.",
    "ol1_li4": "The mathematical formula we use is the same basis as in chess (classic ELO), but multiplying the impact according to the type of match. This way we reward more those who respond better under pressure and in important matches, without ceasing to count the rest of the season.",
    "p21": "How you can move up in the ranking",
    "li18": "Your ELO, and therefore your position in the annual ranking, will change throughout the year according to your results in:",
    "li19": "The previous Summer League (already played; we have taken it into account this time to have a sufficient sample of results).",
    "li20": "The Autumn League.",
    "p22": "The Monday tournaments that are marked as 'ranked'.",
    "h2_6": "The Open prior to the 2026 Summer League.",
    "p23": "The 2026 Summer League itself (group stage and playoffs).",
    "li21": "For this first classification for 2026, we have also taken into account the results of the previous Summer League, so that the ranking starts from a more solid basis and with more matches computed per player.",
    "li22": "From now on, the system will be annual:",
    "li23": "The ELO ranking will be renewed every November.",
    "li24": "When the season closes (after the Vitoria National), the annual ranking is frozen and the one for the following year begins to be built with the new results.",
    "li25": "What can you do",
    "p24": "To move up in the ranking:",
    "p25": "Play a lot: the more official matches you play, the more opportunities you have to adjust your ELO to your true level.",
    "li26": "Play against strong people: if you beat players with a high ELO, you go up more.",
    "li27": "Be consistent: a good run in leagues and on Mondays can place you very high in the annual classification.",
    "h2_7": "The Monday tournaments are especially important if:",
    "p26": "You have played little in the leagues.",
    "li28": "You feel that your ELO does not reflect your current level (for example, if you have improved a lot in recent months).",
    "li29": "Both players who are already in the ranking and new players can use the Monday tournaments to:",
    "li30": "Adjust their ELO to their real level.",
    "p27": "Climb positions in the annual classification.",
    "li31": "The more ranked matches you play, the more realistic your ELO will be.",
    "li32": "New players: how they enter the system",
    "p28": "If you have never played a league at La Catrina or do not yet appear in the ranking:",
    "li33": "Before the 2026 Summer League, we will organize an Open open to new players and anyone who wants to adjust their ELO.",
    "li34": "In that Open:",
    "p29": "If you enter and beat players who already have a high ELO, you will start with a higher initial ELO.",
    "h2_8": "If you lose against almost everyone, your starting ELO will be lower.",
    "p30": "The idea is that, from the beginning of the league, you are placed in a group that fits your level, and that your ELO is as faithful as possible to your game.",
    "li35": "The Open will serve two purposes:",
    "p31": "Calibrate the ELO of new players (and adjust that of those who have improved a lot).",
    "li36": "Help distribute the groups of the 2026 Summer League more evenly.",
    "li37": "In addition to that Open, new players will also be able to enter the system through the Monday tournaments:",
    "p32": "Their first ranked matches will serve to estimate their initial level.",
    "p33": "From there, their ELO will be adjusted just like everyone else's, depending on who they play against and what results they get.",
    "p34": "At the end of the 2026 Summer League, the top 4 in the ranking will be chosen to represent La Catrina in the national tournament.",
    "p35": "As you play leagues and Monday tournaments, your ELO will go up or down.",
    "p36": "The results of the previous Summer League and the 2025 Autumn League (to have a sufficiently large sample of matches).",
    "p37": "The Monday tournaments that have been marked as ranked up to this moment.",
    "p38": "Updated ELO Ranking (12/01/2025):"
  }
}
