{
  "header": {
    "nav": {
      "home": "Inicio",
      "calendar": "Calendario",
      "standings": "Clasificaciones",
      "admin": "Admin",
      "schedule": "Programar Partido",
      "playoffs": "Playoffs",
      "ranking": "Liga Verano 2026 & Ranking Anual"
    },
    "logout": "Salir",
    "login": "Entrar"
  },
  "playoffs": {
    "title": "Playoffs",
    "roundOf16": "Octavos de Final",
    "toBeDetermined": "Por determinar"
  },
  "qualification": {
    "noRemainingMatches": "No le quedan partidas por jugar. Su clasificación depende de otros resultados.",
    "winAllAndDepend": "Necesita ganar todas sus partidas restantes y que otros resultados le favorezcan.",
    "winAtLeast": "Necesita ganar al menos {{winsNeeded}} de las {{remainingMatches}} partidas restantes.",
    "complexScenario": "Su clasificación es compleja y depende de múltiples combinaciones de resultados."
  },
  "loading": "Cargando...",
  "home": {
    "title": "8 Ball League La Catrina 2025"
  },
  "calendar": {
    "title": "Calendario de Partidos",
    "description": "Consulta los enfrentamientos programados para cada semana",
    "status": {
      "finished": "Finalizado",
      "scheduled": "Programado"
    },
    "noDate": "Fecha por definir",
    "location": "Mesa de Billar",
    "winner": "Ganador:",
    "week": "Semana {{week}}",
    "scheduledMatches": "{{count}} partidos programados",
    "group": "Grupo {{group}}",
    "matches": "{{count}} partidos",
    "noMatches": "No hay partidos programados",
    "noMatchesForWeek": "No se encontraron partidos para la semana {{week}}"
  },
  "standings": {
    "title": "Clasificaciones",
    "description": "Consulta las posiciones y estadísticas de cada grupo",
    "stats": {
      "matches": "Partidas",
      "won": "Ganados",
      "lost": "Perdidos",
      "gamesWon": "Juegos Ganados",
      "gamesLost": "Juegos Perdidos",
      "winPercentage": "% Victoria"
    },
    "legend": {
      "title": "Leyenda",
      "scoring": "Sistema de Puntuación:",
      "victory": "Victoria: 3 puntos",
      "defeat": "Derrota: 0 puntos",
      "tieBreak": "Criterios de Desempate:",
      "criterion1": "1. Mayor puntuación",
      "criterion2": "2. Mayor número de partidas ganadas",
      "criterion3": "3. Mayor número de juegos ganados"
    },
    "group": "Grupo {{group}}",
    "groupTitle": "Clasificación - Grupo {{group}}",
    "noPlayers": "No hay jugadores en este grupo",
    "addPlayersHint": "Agrega jugadores desde el panel de administración"
  },
  "login": {
    "title": "Acceso Administrativo",
    "subtitle": "Ingresa la contraseña para administrar la liga",
    "password": "Contraseña",
    "error": "Contraseña incorrecta",
    "submit": "Entrar",
    "footer1": "Solo administradores autorizados pueden acceder",
    "footer2": "¿Problemas para acceder? Contacta al administrador"
  },
  "ranking": {
    "title": "Sistema de ranking ELO y Liga de Verano 2026",
    "p1": "La próxima Liga de Verano de La Catrina comenzará entre finales de marzo y principios de abril de 2026. En las próximas semanas concretaremos y publicaremos las fechas definitivas, pero ya podemos adelantar algo importante: a partir de ahora, la liga formará parte de un sistema de clasificación anual.",
    "h2_1": "Antes: premio de la Liga de Otoño",
    "p2": "Hasta ahora, la Liga de Otoño incluía como premio el alojamiento y la inscripción para los 3 mejores jugadores en el Torneo Nacional de Vitoria en noviembre de cada año.",
    "h2_2": "Ahora: clasificación anual para el equipo de Vitoria",
    "p3": "A partir de 2026, cambia el sistema:",
    "li1": "Se formará un equipo de 4 jugadores para representar a La Catrina en el Nacional de Vitoria.",
    "li2": "Esos 4 jugadores saldrán de un ranking anual, calculado con el sistema ELO (el mismo que se usa en ajedrez y otros deportes).",
    "p4": "Los 4 primeros del ranking ELO cuando termine la Liga de Verano 2026 serán los que representen a La Catrina en el torneo nacional. Es decir: ya no basta con hacer una buena liga suelta; cuentan todos tus resultados oficiales a lo largo del año.",
    "h2_3": "¿Qué es el ELO y para qué sirve?",
    "p5": "El ELO es un número que intenta medir tu nivel real como jugador, basándose en contra quién juegas y qué resultados consigues.",
    "p6": "Si ganas a jugadores fuertes, tu ELO sube más.",
    "p7": "Si pierdes contra jugadores débiles, tu ELO baja más.",
    "p8": "Si ganas a alguien que tiene un nivel parecido al tuyo, tu ELO sube un poco.",
    "p9": "Si pierdes contra alguien claramente más fuerte, apenas te penaliza.",
    "p10": "En resumen:",
    "li3": "Un ELO más alto indica que, de media, ganas a buenos jugadores.",
    "li4": "Un ELO más bajo indica que, de media, pierdes contra buenos jugadores o solo ganas a rivales muy por debajo.",
    "h2_4": "Cómo se calcula el ELO (explicado en cristiano)",
    "p11": "La idea básica es:",
    "li5": "Cada jugador tiene un número: su ELO actual.",
    "li6": "Antes de cada partido, el sistema estima quién es favorito según el ELO de cada uno.",
    "li7": "Después del partido:",
    "h3_1": "Si gana el favorito, sube un poco y el otro baja un poco.",
    "p12": "Si gana el no favorito, sube bastante y el favorito baja bastante.",
    "li8": "Ana sube unos puntos.",
    "li9": "Pablo baja los mismos puntos.",
    "p13": "Si jugaran muchas veces y estuvieran igualados en victorias y derrotas, sus ELOs se quedarían más o menos donde estaban.",
    "li10": "Ana tiene 1700 de ELO.",
    "li11": "Pablo tiene 1400 de ELO.",
    "p14": "Aquí el sistema cree que Ana es muy favorita.",
    "h3_2": "Si gana Ana (lo esperado):",
    "p15": "Ana sube muy poco.",
    "li12": "Pablo baja muy poco.",
    "li13": "Si gana Pablo (sorpresa):",
    "p16": "Pablo sube bastantes puntos.",
    "li14": "Ana baja bastantes puntos.",
    "li15": "Cuanto mayor es la sorpresa, mayor es el ajuste.",
    "p17": "Qué partidos cuentan más para el ELO",
    "li16": "No todos los partidos pesan igual. En La Catrina hemos decidido que, para el cálculo del ELO y de la clasificación anual, los partidos tengan distinta importancia según el contexto.",
    "li17": "De mayor a menor peso:",
    "p18": "Semifinales y Final de las ligas",
    "h2_5": "Cuartos y octavos de final",
    "p19": "Partidos de fase de grupos de las ligas",
    "p20": "Partidos de torneos de los lunes",
    "ol1_li1": "Ganar una semifinal o una final contra un buen jugador te puede subir bastante el ELO.",
    "ol1_li2": "Ganar un partido de grupos o de un torneo de lunes también suma, pero un poco menos.",
    "ol1_li3": "Una derrota en un partido clave de playoff contra alguien con menos ELO te puede hacer bajar más que una derrota en un lunes cualquiera.",
    "ol1_li4": "La fórmula matemática que usamos es la misma base que en ajedrez (ELO clásico), pero multiplicando el impacto según el tipo de partido. Así premiamos más a quien responde mejor bajo presión y en partidos importantes, sin dejar de contar el resto de la temporada.",
    "p21": "Cómo puedes subir en el ranking",
    "li18": "Tu ELO, y por tanto tu posición en el ranking anual, irá cambiando a lo largo del año según tus resultados en:",
    "li19": "La Liga de Verano anterior (ya disputada; la hemos tenido en cuenta esta vez para disponer de una muestra suficiente de resultados).",
    "li20": "La Liga de Otoño.",
    "p22": "Los torneos de los lunes que estén marcados como ranqueados.",
    "h2_6": "El Open previo a la Liga de Verano 2026.",
    "p23": "La propia Liga de Verano 2026 (fase de grupos y playoffs).",
    "li21": "Para esta primera clasificación de cara a 2026, hemos tenido en cuenta también los resultados de la anterior Liga de Verano, para que el ranking parta de una base más sólida y con más partidos computados por jugador.",
    "li22": "A partir de ahora, el sistema será anual:",
    "li23": "El ranking ELO se renovará cada mes de noviembre.",
    "li24": "Al cerrarse la temporada (después del Nacional de Vitoria), se congela el ranking anual y empieza a construirse el del año siguiente con los nuevos resultados.",
    "li25": "Qué puedes hacer tú",
    "p24": "Para subir en el ranking:",
    "p25": "Juega mucho: cuantos más partidos oficiales juegues, más oportunidades tienes de ajustar tu ELO a tu verdadero nivel.",
    "li26": "Juega contra gente fuerte: si ganas a jugadores con ELO alto, subes más.",
    "li27": "Sé constante: una buena racha en ligas y lunes puede colocarte muy arriba en la clasificación anual.",
    "h2_7": "Los torneos de los lunes son especialmente importantes si:",
    "p26": "Has jugado poco en las ligas.",
    "li28": "Sientes que tu ELO no refleja tu nivel actual (por ejemplo, si has mejorado mucho en los últimos meses).",
    "li29": "Tanto los jugadores que ya están en el ranking como los jugadores nuevos pueden usar los torneos de los lunes para:",
    "li30": "Ajustar su ELO a su nivel real.",
    "p27": "Ir escalando posiciones en la clasificación anual.",
    "li31": "Cuantos más partidos ranqueados juegues, más realista será tu ELO.",
    "li32": "Jugadores nuevos: cómo entran en el sistema",
    "p28": "Si nunca has jugado una liga en La Catrina o no apareces todavía en el ranking:",
    "li33": "Antes de la Liga de Verano 2026 organizaremos un Open abierto a jugadores nuevos y a quien quiera ajustar su ELO.",
    "li34": "En ese Open:",
    "p29": "Si entras y ganas a jugadores que ya tienen un ELO alto, empezarás con un ELO inicial más alto.",
    "h2_8": "Si pierdes contra casi todos, tu ELO de partida será más bajo.",
    "p30": "La idea es que, ya desde el inicio de la liga, estés colocado en un grupo que encaje con tu nivel, y que tu ELO sea lo más fiel posible a tu juego.",
    "li35": "El Open servirá para dos cosas:",
    "p31": "Calibrar el ELO de jugadores nuevos (y ajustar el de quienes han mejorado mucho).",
    "li36": "Ayudar a distribuir los grupos de la Liga de Verano 2026 de forma más equilibrada.",
    "li37": "Además de ese Open, los jugadores nuevos también podrán ir entrando en el sistema a través de los torneos de los lunes:",
    "p32": "Sus primeros partidos ranqueados servirán para estimar su nivel inicial.",
    "p33": "A partir de ahí, su ELO se irá ajustando igual que el de los demás, según contra quién jueguen y qué resultados consigan.",
    "p34": "Al terminar la Liga de Verano 2026, los 4 primeros del ranking serán los elegidos para representar a La Catrina en el torneo nacional.",
    "p35": "A medida que juegues ligas y torneos de lunes, tu ELO subirá o bajará.",
    "p36": "Los resultados de la Liga de Verano anterior y de la Liga de Otoño 2025 (para tener una muestra suficientemente amplia de partidos).",
    "p37": "Los torneos de los lunes que se hayan marcado como ranqueados hasta este momento.",
    "p38": "Ranking ELO actualizado (01/12/2025):"
  }
}
